In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('/Users/delinaivanova/Library/CloudStorage/OneDrive-Personal/UoT/Micro Courses/Data Science/3250 B/Module 1/MessyData.csv')

In [3]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     object
 6   Income         26 non-null     float64
 7   CreditLimit    30 non-null     object
 8   MaritalStatus  24 non-null     object
dtypes: float64(1), object(8)
memory usage: 2.2+ KB

In [6]:
# count total number of missing values
df.isnull().sum().sum()

10

In [8]:
df.shape

(30, 9)

In [9]:
# calculate total number of data points in data frame
df.shape[0] * df.shape[1]

270

In [10]:
# calculate % of missing values

df.isnull().sum().sum() / (df.shape[0]*df.shape[1])

0.037037037037037035

In [12]:
# calculate % of missing data by column
df.isnull().sum() / df.shape[0]

Name             0.000000
PhoneNumber      0.000000
City             0.000000
Address          0.000000
PostalCode       0.000000
BirthDate        0.000000
Income           0.133333
CreditLimit      0.000000
MaritalStatus    0.200000
dtype: float64

In [14]:
# we can check quickly what would happen if we drop all data - we see we would be left with only 21 observations
df.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 0 to 28
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           21 non-null     object
 1   PhoneNumber    21 non-null     object
 2   City           21 non-null     object
 3   Address        21 non-null     object
 4   PostalCode     21 non-null     object
 5   BirthDate      21 non-null     object
 6   Income         21 non-null     float64
 7   CreditLimit    21 non-null     object
 8   MaritalStatus  21 non-null     object
dtypes: float64(1), object(8)
memory usage: 1.6+ KB

In [23]:
df['CreditLimit'] = pd.to_numeric(df['CreditLimit'], errors='coerce')

In [55]:
# find values with text only
df2 = pd.read_csv('/Users/delinaivanova/Library/CloudStorage/OneDrive-Personal/UoT/Micro Courses/Data Science/3250 B/Module 1/MessyData.csv')
text_only = df2[df2['CreditLimit'].str.isalpha()]

In [56]:
text_only

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [24]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,NaN,NaN

In [22]:
df['CreditLimit'].replace('high',5000)

0      500
1     5000
2     3000
3     4000
4     5000
5     4500
6     5000
7      500
8     3500
9     3000
10    1000
11    4000
12    2500
13    3000
14    1000
15    2500
16    3000
17    3800
18    4000
19    3000
20    4500
21    4500
22    3500
23     500
24    3500
25    3000
26    1000
27    3800
28    2500
29    5000
Name: CreditLimit, dtype: object

In [33]:
# fixing the datetime data type

df['BirthDate'] = pd.to_datetime(df['BirthDate'])

/var/folders/75/tr_v06ms4k7gy38vcppxbcf80000gn/T/ipykernel_46510/1139435587.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['BirthDate'] = pd.to_datetime(df['BirthDate'])

In [34]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,2052-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [35]:
import datetime

In [42]:
datetime.datetime.today().year

2023

In [43]:
def fix_birthdate(x):
    if x.year > datetime.datetime.today().year:
        year = x.year - 100
    else:
        year = x.year

    return datetime.date(year, x.month, x.day)

In [45]:
df['BirthDate'] = df['BirthDate'].apply(fix_birthdate)

In [46]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [47]:
# check for spellings in the City column
df['City'].unique()

array(['Yellowknife', 'Ottawa', 'Winnipeg', 'Charlottetown',
       'Charlotttetownn', 'Toronto', 'Winnipegg', 'Ottawas', 'Toronot'],
      dtype=object)

In [48]:
# check for spellings in the marital status column
df['MaritalStatus'].unique()

array(['Single', 'Divorced', 'Married', nan], dtype=object)

In [49]:
# replace misspelling directly
df['City'] = df['City'].replace('Charlotttetownn','Charlottetown')

In [50]:
# OR map misspellings to a correct spelling
corrections_dict = {'Yellowknife':'Yellowknife', 
                    'Ottawa':'Ottawa', 
                    'Winnipeg':'Winnipeg', 
                    'Charlottetown':'Charlottetown',
                    'Charlotttetownn':'Charlottetown', 
                    'Toronto':'Toronto', 
                    'Winnipegg':'Winnipeg', 
                    'Ottawas':'Ottawa', 
                    'Toronot':'Toronto'}

In [51]:
df['City'] = df['City'].map(corrections_dict)

In [53]:
df['City'].unique()

array(['Yellowknife', 'Ottawa', 'Winnipeg', 'Charlottetown', 'Toronto'],
      dtype=object)

In [57]:
# Missing Data
df.groupby('MaritalStatus').count()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit
MaritalStatus,,,,,,,,
Divorced,7,7,7,7,7,7,5,7
Married,9,9,9,9,9,9,8,9
Single,8,8,8,8,8,8,8,8

In [58]:
# fill in with a constant
df['MaritalStatus'] = df['MaritalStatus'].fillna('Unknown')

In [61]:
# fill in with aggregate value for a single column
df['CreditLimit'] = df['CreditLimit'].fillna(df['CreditLimit'].median())

In [59]:
# for a more complex application, we could use groupby
df.groupby('City')['Income'].median()

City
Charlottetown    122042.0
Ottawa            75545.0
Toronto           75039.0
Winnipeg          79284.5
Yellowknife      122699.0
Name: Income, dtype: float64

In [60]:
df['Income'].median()

107770.5

In [63]:
df['Income'] = df['Income'].fillna(df.groupby('City')['Income'].transform('median'))

In [65]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown

In [67]:
df2['CreditLimit'] = pd.to_numeric(df2['CreditLimit'], errors='coerce')

In [70]:
df2.describe()

              Income  CreditLimit
count      26.000000    29.000000
mean   104742.461538  3055.172414
std     52935.742490  1403.970443
min     18475.000000   500.000000
25%     66131.250000  2500.000000
50%    107770.500000  3000.000000
75%    146980.750000  4000.000000
max    256360.000000  5000.000000

In [68]:
df2.dropna().describe()

              Income  CreditLimit
count      21.000000    21.000000
mean   106222.238095  3147.619048
std     56543.729211  1415.492511
min     18475.000000   500.000000
25%     60658.000000  2500.000000
50%    117630.000000  3500.000000
75%    147312.000000  4000.000000
max    256360.000000  5000.000000

In [69]:
df.describe()

              Income  CreditLimit
count      30.000000    30.000000
mean   103932.400000  3053.333333
std     49954.624336  1379.588478
min     18475.000000   500.000000
25%     69548.500000  2500.000000
50%    107770.500000  3000.000000
75%    141432.250000  4000.000000
max    256360.000000  5000.000000

In [71]:
df2.describe()

              Income  CreditLimit
count      26.000000    29.000000
mean   104742.461538  3055.172414
std     52935.742490  1403.970443
min     18475.000000   500.000000
25%     66131.250000  2500.000000
50%    107770.500000  3000.000000
75%    146980.750000  4000.000000
max    256360.000000  5000.000000